tap 'caskroom/versions' # for e.g. Java 9
brew 'mas' # for Mac App Store stuff

# Bash and general CLI tools
brew 'bash-completion'
brew 'coreutils'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'tmux'
brew 'tree'
brew 'watchman'
brew 'wget'

# Cloud CLIs
cask 'google-cloud-sdk'
brew 'awscli'
brew 'azure-cli'
brew 'kubernetes-cli'

# Editors
brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'srgb']
cask 'macdown'

# DBs
brew 'mongo'
brew 'postgres'

# JS
brew 'node' # lots of internet noise around this; evaluate.
brew 'nodenv'
brew 'npm'
brew 'yarn'

# Ruby
brew 'rbenv'

# Rust
brew 'rustup-init'

# Python
brew 'pyenv'
brew 'pyenv-virtualenv'

# Java
brew 'jenv'
cask 'java'
cask 'java9-beta'

# OS/Environment mod apps
cask 'dropbox'
cask 'slate'
cask 'karabiner' unless system "bin/version gt 10.11"
cask 'karabiner-elements' unless system "bin/version lt 10.12"

# Plane, lathe, chisel, etc.
# (lots of machines have Chrome pre-installed, which brew cask doesn't handle well)
cask 'google-chrome' unless system "test -f '/Applications/Google\ Chrome.app/Contents/Info.plist'"
cask 'iterm2'
cask 'postman'

# All mas stuff so that password prompt comes as late as possible
mas '1Password', id: 443987910
mas 'Xcode', id: 497799835
mas 'Kindle', id: 405399194
mas 'OmniFocus', id: 867299399
mas 'Slack', id: 803453959 # TODO not sure this needs a mas install
                           # vs. e.g. cask; what's the benefit?
